XML/Public/GETPAYINFOBATCH-PBQB01/request/body_GETPAYINFOBATCH-PBQB01.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:out="http://outsystem.ats.com.cn">
   <soapenv:Header/>
   <soapenv:Body>
      <out:outSystemWS>
         <out:in0>
<![CDATA[
<MBS>
    <pub>
        <SRCOUTSYSTEMCODE>NC</SRCOUTSYSTEMCODE>
        <SRCBATCHNO>sandy20190314</SRCBATCHNO>
        <TRANSCODE>PBQB01</TRANSCODE>
        <TRANSDATETIME>2019-03-14 08:20:10</TRANSDATETIME>
        <MD5>158cfd893b0598f078f7efa4e6b11696</MD5>
    </pub>
    <req>
    <head>
        <COMMANDCODE>GETPAYINFOBATCH</COMMANDCODE>
        <PAGEINDEX>1</PAGEINDEX>
        <PAGESIZE>100</PAGESIZE>
    </head>
        <searchconditions>
        <SRCBATCHNO>wy201903</SRCBATCHNO>
        </searchconditions>
    </req>
</MBS>
         ]]>
</out:in0>
      </out:outSystemWS>
   </soapenv:Body>
</soapenv:Envelope>